Analysis/oil-stocks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oil stocks</title>
<!-- 2016-07-18 Mon 22:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" href="/stylesheets/bootstrap.min.css" media="screen" />
<link rel="stylesheet" href="/stylesheets/bootstrap-responsive.min.css" media="screen" />
<link rel="stylesheet" href="/stylesheets/org.css" type="text/css" />
<link rel="SHORTCUT ICON" href="/favicon.png" type="image/x-icon" />
<link rel="icon" href="/favicon.png" type="image/ico" />
</head>
<body>
<div id="preamble" class="status">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-60502031-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

  document.addEventListener('DOMContentLoaded',function() {
      document.getElementById("table-of-contents").onclick = function() {
          var elem = document.getElementById("text-table-of-contents");
          elem.style.display = elem.style.display == "block" ? "none" : "block";
      }
  });
</script>
</div>
<div id="content">
<h1 class="title">Oil stocks</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">5 high debt loads:</a></li>
<li><a href="#sec-2">5 low debt levels</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">5 high debt loads:<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup><sup>, </sup><sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-1">
<p>
in 2014
</p>

<ul class="org-ul">
<li>Halcon Resources (NYSE:HK)
<ul class="org-ul">
<li>total liabilities in the third quarter of $4,416 million versus
shareholders' equity of only $1,518 million. 
</li>
<li>a very high 3 to 1 debt to equity ratio. 
</li>
<li>revenues would come out to $1,224 million. The company's debt
level is almost 3 times its annual revenues. 
</li>
</ul>
</li>
<li>Oasis Petroleum (NYSE:OAS)
<ul class="org-ul">
<li>liabilities in the third quarter of $3,272 million versus
shareholder equity of only $1,520 million
</li>
<li>a high 2 to 1 debt to equity ratio
</li>
<li>an annualized basis revenues would come out to $1,400 million. The
company's debt is more than 2 times its annual revenue.
</li>
<li>debt will be in 2019
</li>
</ul>
</li>
<li>Sanchez Energy (NYSE:SN)
<ul class="org-ul">
<li>total liabilities of $2,026 million versus shareholder equity of $1,079.
</li>
<li>almost a 2 to 1 debt to equity ratio.
</li>
<li>annualized basis revenues:  $827 million, debt almost 2 1/2 times
its annualized revenues
</li>
</ul>
</li>
<li>Triangle Petroleum (NYSEMKT:TPLM)   
<ul class="org-ul">
<li>total liabilities of $1,015 million versus $536 million in
shareholder equity
</li>
<li>a relatively high debt to equity ratio of 2 to 1. 
</li>
<li>a very high 3 to 1 debt to revenue ratio
</li>
</ul>
</li>
<li>Goodrich Petroleum (NYSE:GDP)
<ul class="org-ul">
<li>$798 million in liabilities versus just $215 million in shareholder equity
</li>
<li>debt to equity ratio is almost 4 to 1.
</li>
<li>annualized basis is $220 million, debt is almost 4 times higher than their revenue
</li>
<li>They had success, but the wells are very expensive and
unfortunately are uneconomic in the current energy commodity price
structure.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">5 low debt levels</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Matador Resources (NYSE:MTDR)
<ul class="org-ul">
<li>total liabilities of $459 million, but the company had shareholder
equity of $818 million.
</li>
<li>approximately a 1 to 2 debt to shareholder equity ratio.
</li>
<li>on an annualized basis totals $388 million. The company had around
a 1 to 1 ratio of its debt compared to the amount of its
annualized revenue.
</li>
</ul>
</li>

<li>Callon Petroleum (NYSE:CPE)
<ul class="org-ul">
<li>Callon has $176 million in total liabilities versus $415 million
in shareholders' equity.
</li>
<li>$1 in debt for every $3 in equity.
</li>
<li>annualizes to $160 million. This is also an almost 1 to 1 debt to
revenue ratio.
</li>
</ul>
</li>
<li>Contango (NYSEMKT:MCF)
<ul class="org-ul">
<li>$277 million in total liabilities versus shareholder equity of
$595 million.
</li>
<li>1 to 2 debt to equity ratio
</li>
<li>annualized basis would total $268 million. almost 1 to 1 debt to
revenue ratio. 
</li>
</ul>
</li>
<li>U.S. Energy (NASDAQ:USEG)
<ul class="org-ul">
<li>$16 million in total liabilities versus $110 million in
shareholders' equity
</li>
<li>debt to equity ratio almost 1 to 7
</li>
<li>$40 million in revenue, approximately 1 time debt to 3 times
revenue.
</li>
</ul>
</li>
<li>Abraxas (NASDAQ:AXAS)
<ul class="org-ul">
<li>total liabilities of $141 million and total shareholders' equity
of $176 million
</li>
<li>debt to equity ratio of less than 1 to 1
</li>
<li>revenue would be $176 million, the debt to revenue ratio would
also be less than 1 debt to 1 times revenue
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://seekingalpha.com/article/2832036-buy-these-5-small-cap-oil-stocks-with-low-debt-levels">http://seekingalpha.com/article/2832036-buy-these-5-small-cap-oil-stocks-with-low-debt-levels</a>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="http://seekingalpha.com/article/3364925-keep-buying-5-small-cap-oil-stocks-with-low-debt-levels">http://seekingalpha.com/article/3364925-keep-buying-5-small-cap-oil-stocks-with-low-debt-levels</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
<script type="text/javascript">
    /* * * CONFIGURATION VARIABLES * * */
    var disqus_shortname = 'finance-wiki';
    
    /* * * DON'T EDIT BELOW THIS LINE * * */
    (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>
</div>
</body>
</html>
